package com.company;

import java.io.Serializable;

public class Contact implements Serializable {
    private String name;
    private int age;
    private String phone;
    private boolean active;

    public Contact(String name, int age, String phone, boolean active) {
        this.name = name;
        this.age = age;
        this.phone = phone;
        this.active = active;
    }

    public String getName() {
        return name;
    }

    public int getAge() {
        return age;
    }

    public String getPhone() {
        return phone;
    }

    public boolean isActive() {
        return active;
    }

    static Contact getRandomContact(){
        String[] nameVacab = new String[]{"Гаврила", "Гала", "Галактион", "Галина", "Гедеон", "Гена", "Геннадий", "Георгий", "Герасим", "Герман", "Гертруд", "Глафира", "Глеб", "Гордей", "Гордея", "Гордиян", "Горимира", "Горн", "Градимир", "Градимира", "Градислав", "Градислава", "Гранислав", "Гранислава", "Гранит", "Григорий", "Груня", "Груша", "Гуля", "Гурий", "Давид", "Давыд", "Даниил", "Данила", "Дар", "Дарья", "Декабрий", "Декабрина", "Дементий", "Демид", "Демьян", "Денис", "Дима", "Дмитрий", "Доброгор", "Добродей", "Добродея", "Добромил", "Добромила", "Добромир", "Добромира", "Доброслав", "Доброслава", "Добрыня", "Доляна", "Дорофей", "Драгомил", "Драгомила", "Драгомир", "Драгослав", "Драгослава", "Дуня", "Ева", "Евгений", "Евгения", "Евграф", "Евдоким", "Евдокия", "Евлампий", "Евпраксия", "Евсей", "Евстафий", "Евстигней", "Егор", "Екатерина", "Елена", "Елизавета", "Елизар", "Елисей", "Елистрат", "Емельян", "Емеля", "Епифан", "Еремей", "Ермил", "Ермолай", "Ерофей", "Есфирь", "Ефим", "Ефимия", "Ефрем", "Ефросинья", "Жанна", "Забава", "Зарина", "Заря", "Захар", "Звенимир", "Звенимира", "Звенислав", "Зинаида", "Зиновий", "Зорий", "Зосима", "Зот", "Зоя", "Иван", "Иванна", "Игнатий", "Игорь", "Избор", "Измаил", "Изот", "Изяслав", "Изяслава", "Илларион", "Илья", "Инна", "Иннокентий", "Иоланта", "Иосиф", "Ипат", "Ипатий", "Ипполит", "Ираклий", "Ирина", "Исай", "Исак", "Исидор", "Исидора", "Искра", "Июлий", "Казимир", "Каллистрат", "Капека", "Капитон", "Карина", "Карл", "Карп", "Касьян", "Катерина", "Катя", "Ким", "Кир", "Кира", "Кирилл", "Клавдий", "Клавдия", "Клара", "Клементий", "Клим", "Климент", "Кондрат", "Кондратий", "Константин", "Корней", "Корнил", "Корнилий", "Красава", "Краснослав", "Ксана", "Ксения", "Кузьма", "Кукша", "Купава", "Лавр", "Лаврентий", "Ладимир", "Ладислав", "Лазарь", "Лана", "Лариса", "Лев", "Леля", "Лена", "Ленар", "Ленара", "Лениан", "Лениана", "Ленина", "Лёня", "Леон", "Леонид", "Леонтий", "Лидия", "Лиза", "Лизавета", "Лилия", "Лонгин", "Лора", "Лука", "Лукерия", "Лукерья", "Лукьян", "Лучезар", "Лучезара", "Любовь", "Любомир", "Людмила", "Лют", "Лютобор", "Лютомир", "Магдалина", "Майслав", "Макар", "Максим", "Максимильян", "Маня", "Маргарита", "Мариан", "Марианна", "Марина", "Мария", "Марк", "Марлен", "Марлена", "Мартын", "Марфа", "Марья", "Марьямна", "Матвей", "Матрёна", "Матрона", "Маша", "Мефодий", "Мечислав", "Милан", "Милен", "Мина", "Мир", "Мирон", "Мирослав", "Митрофан", "Митя", "Михаил", "Михей", "Млад", "Модест", "Моисей", "Мокий", "Мстислав", "Надежда", "Назар", "Найда", "Настасья", "Настя", "Наталия", "Натан", "Наум", "Нестор", "Ника", "Никандр", "Никанор", "Никита", "Никифор", "Никодим", "Николай", "Никон", "Нина", "Нинелла", "Нинель", "Нифонт", "Новомир", "Нона", "Нонна", "Оксана", "Октябрин", "Октябрина", "Октябрь", "Олег", "Олель", "Олеля", "Олимпий", "Ольга", "Оля", "Онисим", "Онуфрий", "Орест", "Осип", "Остап", "Остромира", "Острослав", "Острослава", "Отрада", "Павел", "Павлик", "Панкрат", "Пантелеймон", "Парамон", "Партизан", "Парфем", "Пахом", "Пелагея", "Переслав", "Петр", "Пимен", "Платон", "Полель", "Поликарп", "Полина", "Порфирий", "Потап", "Правдина", "Прасковья", "Прекраса", "Пров", "Прокл", "Прохор", "Рада", "Радим", "Радинка", "Радомира", "Радослава", "Разумник", "Раиса", "Ратибор", "Ратимир", "Ратимира", "Ратмир", "Ревмир", "Ревмира", "Римма", "Родион", "Роза", "Роксана", "Роман", "Ростислав", "Рубен", "Рус", "Руслан", "Руся", "Руфина", "Рэм", "Рюрик", "Савва", "Савватий", "Савелий", "Самсон", "Самуил", "Саня", "Саша", "Свет", "Света", "Светлана", "Светогор", "Светозар", "Свобода", "Святобор", "Святослав", "Севастьян", "Север", "Северян", "Селиван", "Семен", "Серафим", "Серафима", "Сергей", "Сивилла", "Сидор", "Сила", "Сильвестр", "Симон", "Слава", "Славий", "Славия", "Смеян", "Смеяна", "Совет", "Сократ", "Соломон", "София", "Софрон", "Софья", "Спартак", "Спиридон", "Ставр", "Сталь", "Станимир", "Станислав", "Стася", "Степан", "Стоян", "Судислав", "Судислава", "Сюзанна", "Таисия", "Тамара", "Тарас", "Татьяна", "Таша", "Твердимир", "Твердимира", "Твердислав", "Твердислава", "Творимир", "Терентий", "Тимофей", "Тимур", "Тина", "Тит", "Тихон", "Тоша", "Трезор", "Трифон", "Трофим", "Удал", "Ульян", "Ульяна", "Устин", "Устинья", "Фаддей", "Фаина", "Февралин", "Федор", "Федос", "Федосий", "Федот", "Фекла", "Феклист", "Феклиста", "Феликс", "Феодора", "Феоктист", "Феофан", "Ферапонт", "Филарет", "Филимон", "Филипп", "Филиппа", "Флорентин", "Фока", "Фома", "Фортунат", "Фотий", "Фрол", "Харитон", "Харлампий", "Христофор", "Чеслав", "Шемяка", "Шура", "Эдуард", "Эмиль", "Эммануил", "Энгель", "Энергий", "Эраст", "Эрнест", "Эрнст", "Юлиан", "Юлиана", "Юлий", "Юлия", "Юра", "Юрий", "Юстина", "Яков", "Якуб", "Ян", "Януарий", "Яр", "Яра", "Яробор", "Яромира", "Ярослав", "Ярослава"};

        return new Contact(nameVacab[ StreamSerialized.randomIntRange(0, nameVacab.length - 1) ], StreamSerialized.randomIntRange(18, 65), Contact.getRandomPhone(), (StreamSerialized.randomIntRange(0,1) == 0) ? false : true);
    }


    static String getRandomPhone(){
        String countryCode = "38";
        String readyPhone = "";
        String[] operators = new String[]{"093", "097", "068", "050", "099", "095"};

        // Get random operator
        int min = 0;
        int max = operators.length-1;
        readyPhone += operators[ StreamSerialized.randomIntRange(min, max) ];

        while( readyPhone.length() < 10 ){
            min = 0;
            max = 9;
            readyPhone += String.format(String.valueOf( StreamSerialized.randomIntRange(min, max) ));
        }

        return countryCode + readyPhone;
    }
}
